<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"bd6ad96906a521262de62c239f5c44fbc66cabec5614ecb18a42321c00d1ce0c","plan_job_ref":"Job Pull Request Checks #3022 at https://github.com/GSA-TTS/FAC/actions/runs/9110758374","plan_out_hash":"abc8502397ab2e4d4b164be08c27dbf9c653087c2aaf8e909527e4147208aea2","plan_hash":"bbe833e7f85d2c4a20a2bf97d415d1178bf532a77190ed10eab9877022a03247","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 3 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.production.module.fac-file-scanner.cloudfoundry_app.scanner_app will be updated in-place
!~  resource "cloudfoundry_app" "scanner_app" {
!~      disk_quota                      = 6144 -> 512
        id                              = "1e2dfa8d-7abc-4f8b-85f1-c93274999615"
!~      memory                          = 12288 -> 512
        name                            = "fac-file-scanner"
#        (18 unchanged attributes hidden)

#        (5 unchanged blocks hidden)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_app.app will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_app" "app" {
+       buildpack                  = (known after apply)
+       command                    = (known after apply)
+       disk_quota                 = (known after apply)
+       enable_ssh                 = (known after apply)
+       environment                = (sensitive value)
+       health_check_http_endpoint = (known after apply)
+       health_check_timeout       = (known after apply)
+       health_check_type          = (known after apply)
+       id                         = (known after apply)
+       instances                  = (known after apply)
+       memory                     = (known after apply)
+       name                       = (known after apply)
+       name_or_id                 = "****************"
+       space                      = (known after apply)
+       stack                      = (known after apply)
+       state                      = (known after apply)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       domain   = (known after apply)
+       id       = (known after apply)
+       internal = (known after apply)
+       name     = "apps.internal"
+       org      = (known after apply)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
+       id       = (known after apply)
+       name     = "production"
+       org      = (known after apply)
+       org_name = "gsa-tts-oros-fac"
+       quota    = (known after apply)
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpack                       = (known after apply)
!~      enable_ssh                      = true -> (known after apply)
+       health_check_http_endpoint      = (known after apply)
!~      health_check_invocation_timeout = 0 -> (known after apply)
!~      health_check_timeout            = 0 -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      id_bg                           = "************************************" -> (known after apply)
!~      instances                       = 2 -> 8
-       labels                          = {} -> null
        name                            = "fac-av-production-fs"
!~      ports                           = [] -> (known after apply)
!~      space                           = "5593dba8-7023-49a5-bdbe-e809fe23edf9" # forces replacement -> (known after apply) # forces replacement
+       stack                           = (known after apply)
#        (8 unchanged attributes hidden)

-       routes {
-           port  = 0 -> null
-           route = "3d584a52-c592-4879-8de9-11198d2f625d" -> null
        }
+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_network_policy.clamav_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav_routing" {
        id = "22404581-6620-4dc7-9fbb-207db75b10be"

-       policy {
-           destination_app = "d8a00476-cd86-4ed7-b0b0-7c396f62a612" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "1e2dfa8d-7abc-4f8b-85f1-c93274999615" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_route.clamav_route must be replaced
-/+ resource "cloudfoundry_route" "clamav_route" {
!~      domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b" # forces replacement -> (known after apply) # forces replacement
!~      endpoint = "fac-av-production-fs.apps.internal" -> (known after apply)
!~      id       = "************************************" -> (known after apply)
+       port     = (known after apply)
!~      space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9" # forces replacement -> (known after apply) # forces replacement
#        (2 unchanged attributes hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
        id                              = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
        name                            = "https-proxy"
!~      source_code_hash                = "48b2f5eba8d1f35c0fbc2f90c2ec87cab180f5f19e7e34b16b9190fe5c5ca09a" -> "e246274fca627d48afccde010de949371f24b6c9974c48aa91044acd36654fa8"
#        (21 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.domain.cloudfoundry_service_instance.external_domain_instance,
  on /tmp/terraform-data-dir/modules/domain/domain/main.tf line 45, in resource "cloudfoundry_service_instance" "external_domain_instance":
  45:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 5 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3022](https://github.com/GSA-TTS/FAC/actions/runs/9110758374)